Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: 1 - Smoothing is applied using an 8 X 4 box filter
fr: 1 - Le lissage est appliqué à l'aide d'un filtre à boîte 8 X 4

source: 2 - Smoothing is applied using an 8 X 8 box filter
fr: 2 - Le lissage est appliqué à l'aide d'un filtre à boîte 8 X 8

source: Search GdipGetSmoothingMode in MSDN Library
fr: Consultez GdipGetSmoothingMode dans la Librairie MSDN.

source: draw a test line to show smoothing effect (default no smoothing)
fr: Trace une ligne de test pour montrer l'effet de lissage (par défaut pas de lissage)

source: set smoothing mode (8 X 4 box filter)
fr: Installe le mode de lissage (8 X 4 boîte filtre)

source: draw a test line to show smoothing effect
fr: Trace une ligne de test pour montrer l'effet de lissage

source: Gets the world transformation matrix of a Graphics object
fr: Obtient la matrice de transformation universelle d'un objet Graphics

source: Pointer to a Matrix object that receives the transformation matrix
fr: Handle de l'objet Matrix qui reçoit la matrice de transformation

source: The contrast value is used for antialiasing text.
fr: La valeur de contraste est utilisée pour l'antialiasing du texte.

source: Search GdipGetWorldTransform in MSDN Library
fr: Consultez GdipGetWorldTransform dans la Librairie MSDN.

source: Gets a set of region objects each of which bounds a range of character positions within a string
fr: Obtient un ensemble d'objets région dont chacun délimite une plage de positions de caractère dans une chaîne

source: The string to measure
fr: La chaîne à mesurer

source: Pointer to a Font object that specifies the font characteristics
fr: Handle de l'objet Font qui spécifie les caractéristiques de la police

source: $tagGDIPRECTF structure that defines the string boundaries
fr: Structure $tagGDIPRECTF qui définit les limites de la chaîne

source: Pointer to a StringFormat object that specifies the character ranges and layout information, such as alignment, trimming, tab stops, and so forth
fr: Handle de l'objet StringFormat qui spécifie les plages de caractères et les informations de mise en page, tels que l'alignement, le rognage, les taquets de tabulation, et ainsi de suite

source: an array of region objects:
fr: Retourne un tableau d'objets région :

source: [0] - Number of regions
fr: [0] - Nombre de régions

source: [1] - Region 1
fr: [1] - Région 1

source: [2] - Region 2
fr: [2] - Région 2

source: [3] - Region 3
fr: [3] - Région 3

source: If the function succeeds, it's the responsibility of the user to release these regions.
fr: Si la fonction réussit, c'est la responsabilité de l'utilisateur de libérer ces régions.

source: Search GdipMeasureCharacterRanges in MSDN Library
fr: Consultez GdipMeasureCharacterRanges dans la Librairie MSDN.

source: Measures the size of a string
fr: Mesure la taille d'une chaîne

source: [0] - $tagGDIPRECTF structure that receives the rectangle that bounds the string
fr: [0] - Structure $tagGDIPRECTF qui reçoit le rectangle qui délimite la chaîne

source: [1] - The number of characters that actually fit into the layout rectangle
fr: [1] - Le nombre de caractères qui correspondent en fait à la mise en page du rectangle

source: [2] - The number of lines that fit into the layout rectangle
fr: [2] - Le nombre de lignes qui correspondent à la mise en page du rectangle

source: Search GdipMeasureString in MSDN Library
fr: Consultez GdipMeasureString dans la Librairie MSDN.

source: Releases the device context of the Graphics object
fr: Libère le contexte de périphérique de l'objet Graphics

source: Handle to the Graphics device context
fr: Handle du contexte de périphérique Graphics

source: Search GdipReleaseDC in MSDN Library
fr: Consultez GdipReleaseDC dans la Librairie MSDN.

source: Sets the clipping region of a Graphics object to an infinite region
fr: Définit la zone de découpage d'un objet Graphics à une région infinie

source: Search GdipResetClip in MSDN Library
fr: Consultez GdipResetClip dans la Librairie MSDN.

source: Sets the world transformation matrix of a Graphics object to the identity matrix
fr: Définit la matrice de transformation universelle d'un objet Graphics à la matrice identité

source: Search GdipResetWorldTransform in MSDN Library
fr: Consultez GdipResetWorldTransform dans la Librairie MSDN.

source: Restores the state of a Graphics object to the state stored by a previous call to the _GDIPlus_GraphicsSave method of the Graphics object
fr: Restaure l'état d'un objet Graphics à l'état mémorisé par un appel précédent à la méthode _GDIPlus_GraphicsSave de l'objet Graphics

source: Value identifying the block of saved state previously returned by _GDIPlus_GraphicsSave().
fr: Valeur identifiant le bloc de l'Etat sauvegardé précédemment retourné par la méthode _GDIPlus_GraphicsSave().

source: Search GdipRestoreGraphics in MSDN Library
fr: Consultez GdipRestoreGraphics dans la Librairie MSDN.

source: set clipping region
fr: Définir la région à découpage

source: save clipping region
fr: Sauvegarde la région de découpage

source: update clipping region
fr: Met à jour la région de découpage

source: restore clipping region
fr: Restaure la zone de découpage

source: Updates the world transformation matrix of a Graphics object with the product of itself and a rotation matrix
fr: Redéfinit la matrice de transformation universelle d'un objet graphique avec le produit d'elle-même par une matrice de rotation

source: The angle, in degrees, of rotation
fr: L'angle, en degrés, de la rotation

source: Order of matrices multiplication:
fr: Ordre des matrices à multiplier:

source: 0 - The rotation matrix is on the left
fr: 0 - La matrice de rotation est à gauche

source: 1 - The rotation matrix is on the right
fr: 1 - La matrice de rotation est situé à droite

source: Search GdipRotateWorldTransform in MSDN Library
fr: Consultez GdipRotateWorldTransform dans la Librairie MSDN.

source: Saves the current state (transformations, clipping region, and quality settings) of a Graphics object
fr: Enregistre l'état actuel (transformations, zone de découpage, et les paramètres de qualité) d'un objet Graphics

source: a value that identifies the saved state.
fr: Retourne une valeur qui identifie l'état sauvegardé.

source: Search GdipSaveGraphics in MSDN Library
fr: Consultez GdipSaveGraphics dans la Librairie MSDN.

source: Updates a Graphics object's world transformation matrix with the product of itself and a scaling matrix
fr: Redéfinit la matrice de la transformation universelle d'un objet Graphics avec le produit de elle-même par une matrice de mise à l'échelle

source: The horizontal scaling factor in the scaling matrix
fr: Le facteur de mise à l'échelle horizontale dans la matrice de mise à l'échelle

source: The vertical scaling factor in the scaling matrix
fr: Le facteur de mise à l'échelle verticale dans la matrice de mise à l'échelle

source: 0 - The scaling matrix is on the left
fr: 0 - La matrice de mise à l'échelle est à gauche

source: 1 - The scaling matrix is on the right
fr: 1 - La matrice de mise à l'échelle est à droite

source: Search GdipScaleWorldTransform in MSDN Library
fr: Consultez GdipScaleWorldTransform dans la Librairie MSDN.

source: Updates the clipping region of this Graphics object to a region that is the combination of itself and the region specified by a graphics path
fr: Redéfinit la région de découpage d'un objet Graphics à une région qui est la combinaison d'elle-même et de la région spécifié par un chemin graphique

source: Pointer to a GraphicsPath object that specifies the region to be combined with the clipping region of the Graphics object
fr: Handle de l'objet GraphicsPath qui spécifie la région qui sera combinée avec la région de découpage de l'objet graphique

source: Regions combination mode:
fr: Mode de combinaison des régions:

source: 0 - The existing region is replaced by the new region
fr: 0 - La région existante est remplacée par la nouvelle région

source: 1 - The existing region is replaced by the intersection of itself and the new region
fr: 1 - La région existante est remplacée par l'intersection d'elle-même et de la nouvelle région

source: 2 - The existing region is replaced by the union of itself and the new region
fr: 2 - La région existante est remplacée par l'union d'elle-même et de la nouvelle région

source: 3 - The existing region is replaced by the result of performing an XOR on the two regions
fr: 3 - La région existant est remplacée par le résultat de l'exécution d'un OU exclusif sur les deux régions

source: 4 - The existing region is replaced by the portion of itself that is outside of the new region
fr: 4 - La région existante est remplacée par la portion d'elle-même qui est en dehors de la nouvelle région

source: 5 - The existing region is replaced by the portion of the new region that is outside of the existing region
fr: 5 - La région existante est remplacée par la portion de la nouvelle région qui est en dehors de la région existante

source: If a figure in the path is not closed, this method treats the nonclosed figure as if it were closed by a straight line that connects the figure's starting and ending points.
fr: Si la figure du chemin graphique n'est pas fermée, cette méthode traite la figure non fermée comme si elle était fermée par un segment qui relie les points de début et de fin de la figure.

source: Search GdipSetClipPath in MSDN Library
fr: Consultez GdipSetClipPath dans la Librairie MSDN.

source: Updates the clipping region of a Graphics object to a region that is the combination of itself and a rectangle
fr: Redéfinit la région de découpage d'un objet Graphics à une région qui est la combinaison d'elle-même et d'un rectangle

source: X coordinate of the upper-left corner of the rectangle
fr: Coordonnée X du coin supérieur gauche du rectangle

source: Y coordinate of the upper-left corner of the rectangle
fr: Coordonnée Y du coin supérieur gauche du rectangle

source: Width of the rectangle
fr: Largeur du rectangle

source: Height of the rectangle
fr: Hauteur du rectangle

source: Search GdipSetClipRect in MSDN Library
fr: Consultez GdipSetClipRect dans la Librairie MSDN.

source: subtract button-area from clipregion
fr: Soustrait la zone du bouton de la zone de découpage

source: subtract slider-area from clipregion
fr: Soustrait la zone du slider de la zone de découpage

source: Updates the clipping region of a Graphics object to a region that is the combination of itself and the region specified by a Region object
fr: Redéfinit la zone de découpage d'un objet graphique en une région qui est la combinaison d'elle-même et de la région spécifiée par un objet Region

source: Pointer to a Region object to be combined with the clipping region of the Graphics object
fr: Handle de l'objet Region qui sera combiné avec la zone de découpage de l'objet Graphics

source: Search GdipSetClipRegion in MSDN Library
fr: Consultez GdipSetClipRegion dans la Librairie MSDN.

source: Sets the compositing quality of a Graphics object
fr: Définit la qualité de composition d'un objet Graphics

source: Compositing quality:
fr: Qualité de composition:

source: Search GdipSetCompositingQuality in MSDN Library
fr: Consultez GdipSetCompositingQuality dans la Librairie MSDN.

source: Sets the interpolation mode of a Graphics object
fr: Définit le mode d'interpolation d'un objet graphique

source: Interpolation mode:
fr: Mode d'interpolation:

source: The interpolation mode determines the algorithm that is used when images are scaled or rotated
fr: Le mode d'interpolation détermine l'algorithme qui est utilisé lorsque des images sont redimensionnées ou tournées par une rotation

source: Search GdipSetInterpolationMode in MSDN Library
fr: Consultez GdipSetInterpolationMode dans la Librairie MSDN.

source: Sets the pixel offset mode of a Graphics object
fr: Définit le mode de décalage des pixels d'un objet Graphics

source: Pixel offset mode:
fr: Mode de décalage des pixels:

source: 0,1,3 - Pixel centers have integer coordinates
fr: 0,1,3 - les centres des pixels ont des coordonnées entières

source: 2,4 - Pixel centers have coordinates that are half way between integer values (i.e.0.5, 20, 105.5, etc...)
fr: 2,4 - Les centres de pixels ont des coordonnées qui sont à mi-chemin entre les valeurs entières (soit 0,5, 20, 105.5, etc...)

source: Search GdipSetPixelOffsetMode in MSDN Library
fr: Consultez GdipSetPixelOffsetMode dans la Librairie MSDN.

source: Sets the graphics object rendering quality
fr: Définit la qualité du rendu de l'objet graphique

source: Smoothing mode:
fr: Le mode de lissage:

source: The Smoothing filter applied using an 8 X 8 box filter requires at minimum the Windows Vista operating system.
fr: Le filtre de lissage appliqué à l'aide d'un filtre à boîte 8 X 8 requiert au minimum le système d'exploitation Windows Vista.

source: Search GdipSetSmoothingMode in MSDN Library
fr: Consultez GdipSetSmoothingMode dans la Librairie MSDN.

source: Sets the contrast value of a Graphics object
fr: Définit la valeur du contraste d'un objet Graphics

source: Text rendering mode:
fr: Mode de rendu de texte:

source: 0 - Character is drawn using the currently selected system font smoothing mode (also called a rendering hint)
fr: 0 - Un caractère est dessiné en utilisant le mode de lissage des polices du système actuellement sélectionné (aussi appelé 'rendu système')

source: 1 - Character is drawn using its glyph bitmap and hinting to improve character appearance on stems and
fr: 1 - Un caractère est dessiné en utilisant le bitmap de son glyphe et en tentant d'améliorer l'apparence du caractère

source: 2 - Character is drawn using its glyph bitmap and no hinting.
fr: 2 - Un caractère est dessiné en utilisant le bitmap de son glyphe sans chercher à améliorer.

source: This results in better performance at the
fr: Il en résulte de meilleures performances au détriment de la qualité

source: 3 - Character is drawn using its antialiased glyph bitmap and hinting.
fr: 3 - Un caractère est dessiné en utilisant le bitmap de son glyphe lissé et amélioré.

source: This results in much better quality
fr: Il en résulte une bien meilleure qualité

source: 4 - Character is drawn using its antialiased glyph bitmap and no hinting.
fr: 4 - Un caractère est dessiné en utilisant le bitmap de son glyphe lissé (anti-crénelage) mais pas amélioré.

source: Stem width differences may be
fr: Des différences de largeur des jambes peuvent être perceptible

source: 5 - Character is drawn using its glyph Microsoft ClearType bitmap and hinting.This type of text rendering
fr: 5 - Un caractère est dessiné à l'aide du bitmap de son glyphe Microsoft ClearType avec amélioration.

source: Search GdipSetTextRenderingHint in MSDN Library
fr: Consultez GdipSetTextRenderingHint dans la Librairie MSDN.

source: Sets the world transformation for a graphics object
fr: Définit la transformation universelle pour un objet graphique

source: Handle to a Matrix object that specifies the world transformation
fr: Handle de l'objet Matrix qui spécifie la transformation universelle

source: Search GdipSetWorldTransform in MSDN Library
fr: Consultez GdipSetWorldTransform dans la Librairie MSDN.

source: #FUNCTION# ==================================================================================================
fr: # # FONCTION =============================================== ================================================== =

source: Name...........:
fr: Nom...........:

source: Syntax.........:
fr: Syntaxe.........:

source: inserts Graphics $hImage2 into $hGraphic
fr: Insère le Graphics $hImage2 dans $hGraphic

source: Parameters ....:
fr: Paramètres....:

source: $hGraphics - Handle to a Graphics object
fr: $hGraphics - Handle d'un objet Graphics

source: $hImage - Handle to an Image object to be inserted
fr: $hImage - Handle de l'objet Image à insérer

source: $iX - The X coordinate of the upper left corner of the inserted image
fr: $iX - La coordonnée X du coin supérieur gauche de l'image insérée

source: $iY - The Y coordinate of the upper left corner of the inserted image
fr: $iy - La coordonnée Y du coin supérieur gauche de l'image insérée

source: $iWidth - The width of the rectangle Border around insert
fr: $iwidth - La largeur de la bordure rectangle autour de l'insertion

source: $iHeight - The height of the rectangle Border around insert
fr: $iheight - La hauteur de la bordure rectangle autour de l'insertion

source: $iARGB - Alpha, Red, Green and Blue components of pen color - Border color
fr: $iARGB - Composantes de couleur du crayon - Bordure:Alpha, Rouge, Vert et Bleu

source: $iPenWidth - The width of the pen measured in the units specified in the $iUnit parameter - Border Width
fr: $iPenWidth - La largeur de la pointe mesurée dans les unités spécifiées dans le paramètre $iUnit - Largeur de la bordure

source: Return values .:
fr: Valeur de retour :

source: Success - True
fr: Succès - True.

source: Failure - False
fr: Echec - False

source: Rotation Matrix
fr: Matrice de rotation

source: get pen + color
fr: Définit un crayon

source: Converts an array of points from one coordinate space to another
fr: Convertit un tableau de points d'un espace de coordonnées à un autre

source: Array of points to be converted:
fr: Tableau de points à convertir:

source: Destination coordinate space
fr: Espace de coordonnées de destination

source: Source coordinate space:
fr: Espace de coordonnées source:

source: 0 - World coordinate space, not physical coordinates
fr: 0 - Espace de coordonnées universel, coordonnées non physiques

source: 1 - Page coordinate space, read-world coordinates
fr: 1 - Espace de coordonnées Page, lecture-universelle

source: 2 - Device coordinate space, physical coordinates
fr: 2 - Espace de coordonnées du périphérique, coordonnées physiques

source: Search GdipTransformPoints in MSDN Library
fr: Consultez GdipTransformPoints dans la Librairie MSDN.

source: Updates a Graphics object's world transformation matrix with the product of itself and a translation matrix
fr: Redéfinit la matrice de transformation universelle d'un objet Graphics avec le produit d'elle-même par une matrice de translation

source: Horizontal component of the translation
fr: Composante horizontale de la translation

source: Vertical component of the translation
fr: La composante verticale de la translation

source: 0 - The translation matrix is on the left
fr: 0 - La matrice de translation est à gauche

source: 1 - The translation matrix is on the right
fr: 1 - La matrice de translation est à droite

source: Search GdipTranslateWorldTransform in MSDN Library
fr: Consultez GdipTranslateWorldTransform dans la Librairie MSDN.

source: Creates a HatchBrush object based on a hatch style, a foreground color, and a background color
fr: Crée un objet HatchBrush (pinceau à hachures) à partir d'un style de hachure, d'une couleur de peinture, et d'une couleur de fond

source: Pattern of hatch lines that will be used, see remarks.
fr: Motif de hachures à utiliser, voir Remarques.

source: Default = $GDIP_HATCHSTYLE_HORIZONTAL (0).
fr: Par défaut = $GDIP_HATCHSTYLE_HORIZONTAL (0).

source: Alpha, Red, Green and Blue components of the hatch lines
fr: Composantes Alpha, Rouge, Vert et Bleu des lignes de hachures

source: Alpha, Red, Green and Blue components of the hatch background
fr: Composantes Alpha, Rouge, Vert et Bleu du fond

source: a pointer to a new HatchBrush object.
fr: Retourne le handle d'un nouvel objet HatchBrush.

source: The pattern constants are declared in GDIPlusConstants.au3, those that start with $GDIP_HATCHSTYLE_*.
fr: Les constantes des motifs de hachures sont déclarées dans GDIPlusConstants.au3, celles qui commencent par $GDIP_HATCHSTYLE_*.

source: When you are done with the HatchBrush object, call _GDIPlus_BrushDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet HatchBrush, appelez _GDIPlus_BrushDispose() pour libérer les ressources.

source: Search GdipCreateHatchBrush in MSDN Library
fr: Consultez GdipCreateHatchBrush dans la Librairie MSDN.

source: Creates an icon handle from a bitmap object
fr: Crée un handle d'icône à partir d'un objet bitmap

source: an icon handle.
fr: Retourne le handle de l'icône.

source: When you are done with the object, call _WinAPI_DestroyIcon() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _WinAPI_DestroyIcon() pour libérer les ressources.

source: Search GdipCreateHICONFromBitmap in MSDN Library
fr: Consultez GdipCreateHICONFromBitmap dans la Librairie MSDN.

source: Create Bitmap with transparency
fr: Crée un Bitmap avec transparence

source: create icon from bitmap
fr: Crée une icône à partir du bitmap

source: Creates an ImageAttributes object
fr: Crée un objet ImageAttributes

source: a pointer to a new ImageAttribute object.
fr: Retourne le handle d'un nouvel objet ImageAttributes.

source: After you are done with the object, call _GDIPlus_ImageAttributesDispose() to release the object resources.
fr: Lorsque vous en avez terminé avec l'objet, appelez _GDIPlus_ImageAttributesDispose() pour libérer les ressources de l'objet.

source: Search GdipCreateImageAttributes in MSDN Library
fr: Consultez GdipCreateImageAttributes dans la Librairie MSDN.

source: use translation color matrix to change the image brightness
fr: Utilise la matrice couleur translation pour changer la luminosité de l'image

source: Releases an ImageAttributes object
fr: Libère un objet ImageAttributes

source: Pointer to an ImageAttribute object
fr: Handle de l'objet ImageAttribute

source: Search GdipDisposeImageAttributes in MSDN Library
fr: Consultez GdipDisposeImageAttributes dans la Librairie MSDN.

source: Sets or clears the color key (transparency range) for a specified category
fr: Définit ou efface la couleur clé (plage de transparence) pour une catégorie déterminée

source: The category for which the color key is set or cleared:
fr: La catégorie pour laquelle la couleur clé doit être définie ou effacée:

source: 0 - Color adjustment applies to all categories that do not have adjustment settings of their own
fr: 0 - Le réglage de la couleur s'applique à toutes les catégories qui n'ont pas leurs propres paramètres de réglage

source: 1 - Color adjustment applies to bitmapped images
fr: 1 - Le réglage de la couleur s'applique à des images bitmap

source: 2 - Color adjustment applies to brush operations in metafiles
fr: 2 - Le réglage de la couleur s'applique aux opérations de pinceau dans les métafichiers

source: 3 - Color adjustment applies to pen operations in metafiles
fr: 3 - Le réglage de la couleur s'applique aux opérations de crayon dans les métafichiers

source: 4 - Color adjustment applies to text drawn in metafiles
fr: 4 - Le réglage de la couleur s'applique au texte dessiné dans les métafichiers

source: If True, transparency range for the specified category is applied; otherwise, transparency
fr: Si Vrai, la plage de transparence pour la catégorie spécifiée est appliquée; autrement, transparence

source: Alpha, Red, Green and Blue components of a color that specifies the low color-key value
fr: Composantes Alpha, Rouge, Vert et Bleu d'une couleur qui indique la valeur de la couleur clé la plus faible.

source: Alpha, Red, Green and Blue components of a color that specifies the high color-key value
fr: Composantes Alpha, Rouge, Vert et Bleu d'une couleur qui indique la valeur de la couleur clé la plus haute

source: Any color that has each of its three components (red, green, blue) between the corresponding components of the high and low color keys is made transparent.
fr: Toute couleur qui a chacune de ses trois composantes (rouge, vert, bleu) entre les composantes correspondantes des couleurs clés haute et basse est transparente.
